# Наиболее часто используемая операция в программировании это увеличение переменной на единицу.
# Она используется при организации счетчиков значений. Операцию увеличения на единицу также
# называют инкремент. Давайте и мы реализуем эту операцию.
# Ваша задача увеличить входящее целое значение на единицу используя присвоение с оператором
# Входные данные
# Целое число
# Выходные данные
# Вывести увеличенное на один значение входного числа
# Sample Input 1:
# 8
# Sample Output 1:
# 9

f=int(input())
f+=1
print(f)
